DataProcessors/НазначениеСотрудника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>НазначениеСотрудника</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ИзменениеСотрудника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ИзменениеСотрудника</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВедущийКонструктор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дизайнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Композиции</v8:Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ИзделияКомплект.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ИзделияКомплект</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГабаритныйЧертеж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГабаритныеЧертежи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВнешнегоСоглосования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКомпозиции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Композиция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Композиции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Конструктор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеКомплекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаСогласование</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаУтверждение</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВерсииКанбан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормаВремени_Монтажа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормаВремени_ПКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормаВремени_Производства</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормаВремени_РКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеПомещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланМонтажа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланПКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланПодряд</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланРКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИзделияЭлемент</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИзделиеЭлемент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИзделияЭлемент</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основное</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Комментарии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Текст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипКомментария</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Образцы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОписаниеДетали</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТребуетсяОбразец</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Образец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Образец</v8:Type>
								<v8:Type>cfg:CatalogRef.ПредварительныйОбразец</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/НазначениеСотрудника/Forms/Форма/Ext/Form/Module.bsl
Процедура СохранитьНаСервере()
	
	ДОбъект = РеквизитФормыВЗначение("ДеревоСотрудники");
	
	Для каждого строкаКомпозиция Из ДОбъект.Строки Цикл
	
		Если строкаКомпозиция.Изменен Тогда
			УстановитьСотрудников(строкаКомпозиция.Композиция, строкаКомпозиция);
			строкаКомпозиция.Изменен = Ложь;
		КонецЕсли;
		
		Для каждого строкаКомплекты Из строкаКомпозиция.Строки Цикл
			
			Если строкаКомплекты.Изменен Тогда
				УстановитьСотрудников(строкаКомплекты.Комплект, строкаКомплекты);	
				строкаКомплекты.Изменен = Ложь;
			КонецЕсли;
			
		КонецЦикла;
	
	КонецЦикла; 
	
	ЗначениеВРеквизитФормы(ДОбъект, "ДеревоСотрудники");
	
КонецПроцедуры

Процедура УстановитьСотрудников(ОбъектИзменения, строкаДанных)

	МенеджерЗаписи = РегистрыСведений.ИзменениеСотрудника.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ОбъектИзменения = ОбъектИзменения;
	МенеджерЗаписи.Прочитать();
	
	Если ЗначениеЗаполнено(строкаДанных.Менеджер) Тогда
		МенеджерЗаписи.Менеджер = строкаДанных.Менеджер;
	ИначеЕсли НЕ ЗначениеЗаполнено(МенеджерЗаписи.Менеджер) Тогда
		МенеджерЗаписи.Менеджер = Менеджер;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(строкаДанных.ВедущийКонструктор) Тогда
 	   МенеджерЗаписи.ВедущийКонструктор = строкаДанных.ВедущийКонструктор;
	ИначеЕсли НЕ ЗначениеЗаполнено(МенеджерЗаписи.ВедущийКонструктор) Тогда
		МенеджерЗаписи.ВедущийКонструктор = ВедущийКонструктор;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(строкаДанных.Дизайнер) Тогда
 	   МенеджерЗаписи.Дизайнер = строкаДанных.Дизайнер;
	ИначеЕсли НЕ ЗначениеЗаполнено(МенеджерЗаписи.Дизайнер) Тогда
		МенеджерЗаписи.Дизайнер = Дизайнер;
	КонецЕсли;
	
    МенеджерЗаписи.ОбъектИзменения = ОбъектИзменения;
	МенеджерЗаписи.Период = ТекущаяДата();
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьНаСервере();
КонецПроцедуры

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	Дата = ТекущаяДата();
	
	ДоступностьКолонок();
	
КонецПроцедуры 

Процедура ДоступностьКолонок()
	
	Если НЕ (РольДоступна("АдминистраторСистемы") ИЛИ РольДоступна("ПолныеПрава")) Тогда
		
		Если НЕ РольДоступна("Дизайнер") Тогда
			Элементы.ТаблицаСотрудникиДизайнер.ТолькоПросмотр = Истина;
		КонецЕсли;  
		
		Если НЕ РольДоступна("ГлавныйКонструктор") Тогда
			Элементы.ТаблицаСотрудникиВедущийКонструктор.ТолькоПросмотр = Истина;
		КонецЕсли;  
		
		Элементы.ТаблицаСотрудникиМенеджер.ТолькоПросмотр = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроектПриИзмененииНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИзделияКомплект.Ссылка КАК Комплект,
	|	ИзделияКомплект.Родитель.Композиция КАК Композиция,
	|	ИзменениеСотрудникаСрезПоследних.Менеджер КАК Менеджер,
	|	ИзменениеСотрудникаСрезПоследних.ВедущийКонструктор КАК ВедущийКонструктор,
	|	ИзменениеСотрудникаСрезПоследних.Дизайнер КАК Дизайнер
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	Справочник.ИзделияКомплект КАК ИзделияКомплект
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИзменениеСотрудника.СрезПоследних(&Дата, ) КАК ИзменениеСотрудникаСрезПоследних
	|		ПО ИзделияКомплект.Ссылка = ИзменениеСотрудникаСрезПоследних.ОбъектИзменения
	|ГДЕ
	|	ИзделияКомплект.Проект = &Проект
	|	И НЕ ИзделияКомплект.ЭтоГруппа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Проекты.Дизайнер КАК Дизайнер,
	|	Проекты.Менеджер КАК Менеджер,
	|	Проекты.ВедущийКонструктор КАК ВедущийКонструктор,
	|	Проекты.Сметчик КАК Сметчик
	|ИЗ
	|	Справочник.Проекты КАК Проекты
	|ГДЕ
	|	Проекты.Ссылка = &Проект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИСТИНА КАК Флаг,
	|	вт.Комплект КАК Комплект,
	|	вт.Композиция КАК Композиция,
	|	ВЫБОР
	|		КОГДА ИзменениеСотрудникаСрезПоследних.Менеджер ЕСТЬ NULL
	|			ТОГДА вт.Менеджер
	|		ИНАЧЕ ИзменениеСотрудникаСрезПоследних.Менеджер
	|	КОНЕЦ КАК Менеджер,
	|	ВЫБОР
	|		КОГДА ИзменениеСотрудникаСрезПоследних.ВедущийКонструктор ЕСТЬ NULL
	|			ТОГДА вт.ВедущийКонструктор
	|		ИНАЧЕ ИзменениеСотрудникаСрезПоследних.ВедущийКонструктор
	|	КОНЕЦ КАК ВедущийКонструктор,
	|	ВЫБОР
	|		КОГДА ИзменениеСотрудникаСрезПоследних.Дизайнер ЕСТЬ NULL
	|			ТОГДА вт.Дизайнер
	|		ИНАЧЕ ИзменениеСотрудникаСрезПоследних.Дизайнер
	|	КОНЕЦ КАК Дизайнер
	|ИЗ
	|	вт КАК вт
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИзменениеСотрудника.СрезПоследних(&Дата, ) КАК ИзменениеСотрудникаСрезПоследних
	|		ПО вт.Композиция = ИзменениеСотрудникаСрезПоследних.ОбъектИзменения
	|
	|УПОРЯДОЧИТЬ ПО
	|	вт.Композиция.Наименование,
	|	вт.Комплект.Наименование
	|ИТОГИ
	|	ИСТИНА КАК Флаг
	|ПО
	|	Композиция";
	
	Запрос.УстановитьПараметр("Проект", Проект);
	Запрос.УстановитьПараметр("Дата", 	КонецДня(Дата));
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка = РезультатЗапроса[2].Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам); // Выгрузка в дерево значений!
	
	// Выгрузка результата запроса в дерево
	КоллекцияЭлементовДерева = ДеревоСотрудники.ПолучитьЭлементы();
	КоллекцияЭлементовДерева.Очистить();
	ОбщегоНазначения.ЗаполнитьКоллекциюЭлементовДереваДанныхФормы(КоллекцияЭлементовДерева, Выборка);
	
	Выборка = РезультатЗапроса[1].Выбрать();
	
	ПустойСотрудник 	= Справочники.Сотрудники.ПустаяСсылка();
	ВедущийКонструктор 	= ПустойСотрудник; 
	Дизайнер 			= ПустойСотрудник; 
	Менеджер 			= ПустойСотрудник; 
	Сметчик 			= ПустойСотрудник; 
	
	
	Пока Выборка.Следующий() Цикл
		
		ЗаполнитьЗначенияСвойств(ЭтаФорма, Выборка);	
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	ПроектПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДеревоСотрудникиПередНачаломИзменения(Элемент, Отказ)
	ТД = Элементы.ДеревоСотрудники.ТекущиеДанные;
	
	Отказ = НЕ (ЗначениеЗаполнено(ТД.Композиция) ИЛИ ЗначениеЗаполнено(ТД.Комплект));
КонецПроцедуры

&НаКлиенте
Процедура ДеревоСотрудникиПриИзменении(Элемент)
	
	ТД = Элементы.ДеревоСотрудники.ТекущиеДанные;
	
	Если НЕ ТД = Неопределено Тогда
		ТД.Изменен = Истина;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоСотрудникиПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоСотрудникиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ПроектПриИзмененииНаСервере();
КонецПроцедуры
